Herin-iaina/esp32-fastapi/routers/main.cpp
#include <WiFi.h>
#include <HTTPClient.h>
#include <ArduinoJson.h>
#include <AccelStepper.h>
#include <LiquidCrystal_I2C.h>
#include "DHT.h"

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "freertos/semphr.h"
#include <esp_task_wdt.h>

// ============================================================
//  SÉLECTION DU DRIVER STEPPER
// ============================================================
#define STEPPER_DRIVER_TYPE_TB6600  1
#define STEPPER_DRIVER_TYPE_A4988   2
#define STEPPER_DRIVER_TYPE  STEPPER_DRIVER_TYPE_TB6600

// ============================================================
//  DÉFINITION DES PINS
// ============================================================
#define DHT_SENSOR_TYPE     DHT22
#define DHT_1_PIN_DATA      33
#define DHT_2_PIN_DATA      34
#define DHT_3_PIN_DATA      35
#define DHT_4_PIN_DATA      36

#define STEPPER_PIN_DIR     12
#define STEPPER_PIN_STEP    13
#define STEPPER_ENABLE_PIN  32

#define STEPPER_ENABLE_ACTIVE_STATE   LOW
#define STEPPER_ENABLE_DISABLE_STATE  HIGH

#define FAN_PIN             14
#define HUMIDIFIER_PIN      15

#define LED_GREEN_PIN       16    // Temp + humidité dans les seuils
#define LED_ORANGE_PIN      17    // Temp ou humidité en dessous du min
#define LED_RED_PIN         18    // Temp ou humidité au dessus du max
#define LED_BLUE_PIN        19    // Serveur inaccessible / mode autonome

#define BUTTON_STEPPER_PIN      23
#define BUTTON_LCD_SCROLL_PIN   27

#define LCD_ADDRESS         0x27
#define LCD_COLS            16
#define LCD_ROWS            2

// ============================================================
//  WIFI & SERVEUR
// ============================================================
const char* ssid       = "Airbox-AB84";
const char* password   = "7ddd6jVJPUR-deEJbxc";
const char* serverIP   = "192.168.1.155";
const int   serverPort = 8000;
const char* apiKey     = "Votre_Cle_API";
const char* HOSTNAME   = "ESP32-Sensor";

// ============================================================
//  SEUILS TEMPÉRATURE / HUMIDITÉ & HYSTÉRÉSIS
// ============================================================
const float TEMP_TARGET       = 37.7f;
const float HUMIDITY_TARGET   = 45.0f;
const float TOLERANCE_PERCENT = 1.5f;

const float TEMP_MIN     = TEMP_TARGET     * (1.0f - TOLERANCE_PERCENT / 100.0f);
const float TEMP_MAX     = TEMP_TARGET     * (1.0f + TOLERANCE_PERCENT / 100.0f);
const float HUMIDITY_MIN = HUMIDITY_TARGET * (1.0f - TOLERANCE_PERCENT / 100.0f);
const float HUMIDITY_MAX = HUMIDITY_TARGET * (1.0f + TOLERANCE_PERCENT / 100.0f);

// Plages d'hystérésis pour la sécurité des relais (mode autonome)
const float TEMP_HYSTERESIS     = 0.3f;
const float HUMIDITY_HYSTERESIS = 0.5f;

// ============================================================
//  TIMING & BUFFERS
// ============================================================
const unsigned long SEND_INTERVAL             = 5000UL;   // ms entre chaque cycle capteurs
const unsigned long LCD_SCROLL_INTERVAL       = 3000UL;   // ms entre chaque défilement auto
const unsigned long RECONNECT_INTERVAL        = 60000UL;  // ms entre tentatives de reconnexion serveur
const unsigned long WIFI_TIMEOUT              = 15000UL;  // ms max pour connexion WiFi
const unsigned long AUTOMATION_POLL_INTERVAL  = 3000UL;   // ms entre chaque poll automation/stepper
const unsigned long HTTP_TIMEOUT              = 1500UL;   // ms timeout par requête HTTP

const int LCD_LOG_BUFFER_SIZE = 6;
const int MAX_SERVER_RETRIES  = 10;

// FIX 1 : WDT à 25s (> WIFI_TIMEOUT de 15s) pour marge de sécurité
const uint32_t WDT_TIMEOUT_SEC = 25;                       

// ============================================================
//  CONFIGURATION STEPPER
// ============================================================
#if STEPPER_DRIVER_TYPE == STEPPER_DRIVER_TYPE_TB6600
  #define STEPPER_MAX_SPEED          1000
  #define STEPPER_ACCELERATION       1000
  #define STEPPER_STEPS_PER_ROTATION  800
  #define STEPPER_SPEED               500
  static const char* DRIVER_NAME = "TB6600 (DIR/STEP)";
#else
  #define STEPPER_MAX_SPEED           300
  #define STEPPER_ACCELERATION       1000
  #define STEPPER_STEPS_PER_ROTATION  200
  #define STEPPER_SPEED               100
  static const char* DRIVER_NAME = "A4988 (DIR/STEP)";
#endif

#define STEPPER_ROTATION_STEPS  (STEPPER_STEPS_PER_ROTATION * 5)

// ============================================================
//  OBJETS GLOBAUX
// ============================================================
DHT dht_1(DHT_1_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_2(DHT_2_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_3(DHT_3_PIN_DATA, DHT_SENSOR_TYPE);
DHT dht_4(DHT_4_PIN_DATA, DHT_SENSOR_TYPE);

AccelStepper stepper(AccelStepper::DRIVER, STEPPER_PIN_STEP, STEPPER_PIN_DIR);
LiquidCrystal_I2C lcd(LCD_ADDRESS, LCD_COLS, LCD_ROWS);

// ============================================================
//  STRUCTURES DE DONNÉES & VARIABLES GLOBALES
// ============================================================
struct SensorData {
  float temperature = 0.0f;
  float humidity    = 0.0f;
  bool  valid       = false;
};

struct SharedState {
  // Écrit par core 1, lu par core 0
  bool     sensorDataReady = false;
  String   pendingPayload;

  // Écrit par core 0, lu par core 1
  bool wifiConnected     = false;
  bool serverConnected   = false;
  bool autonomousMode    = false;
  int  serverFailCount   = 0;

  bool fanCmdFromServer      = false;
  bool humidCmdFromServer    = false;
  bool automationCmdPending  = false;

  bool stepperRequestPending = false;
};

SharedState shared;
SemaphoreHandle_t stateMutex;
SemaphoreHandle_t lcdLogMutex;
TaskHandle_t networkTaskHandle;

bool  fanOn           = false;
bool  humidifierOn    = false;
bool  autonomousMode  = false;   // Copie locale Core 1
bool  serverConnected = false;   // Copie locale Core 1
bool  wifiConnected   = false;   // Copie locale Core 1

float avgTemperature  = 0.0f;
float avgHumidity     = 0.0f;
int   numFailedSensors = 0;
bool  stepperEnabled   = false;

// Anti-rebond non-bloquant
unsigned long lastButtonPress       = 0;
unsigned long lastScrollButtonPress = 0;
bool stepperBtnPendingCheck         = false;
bool lcdBtnPendingCheck             = false;
unsigned long stepperBtnTriggerTime = 0;
unsigned long lcdBtnTriggerTime     = 0;

// LCD log ring buffer
char lcdLogBuffer[LCD_LOG_BUFFER_SIZE][LCD_COLS + 1];
int  lcdLogCount = 0;
int  lcdLogIndex = 0;
int  lcdLogStart = 0;
unsigned long lastLogScroll = 0;

