Herin-iaina/esp32-fastapi/routers/main.cpp
// ============================================================
//  GESTION STEPPER / POWER (Core 1)
// ============================================================

void enableStepper() {
  if (!stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_ACTIVE_STATE);
    delayMicroseconds(100);
    stepperEnabled = true;
  }
}

void disableStepper() {
  if (stepperEnabled) {
    digitalWrite(STEPPER_ENABLE_PIN, STEPPER_ENABLE_DISABLE_STATE);
    stepperEnabled = false;
  }
}

void startStepperRotation(const char* origin) {
  if (stepper.distanceToGo() != 0) {
    Serial.printf("Rotation ignoree (%s) — moteur deja en mouvement\n", origin);
    return;
  }
  Serial.printf("Rotation stepper activee (%s)\n", origin);
  stepper.setMaxSpeed(STEPPER_SPEED);
  enableStepper();
  stepper.move(STEPPER_ROTATION_STEPS);
}

// ============================================================
//  UTILITAIRES LCD LOG & DISPLAY (Core 1)
// ============================================================

void printLCDLine(int row, const char* line) {
  lcd.setCursor(0, row);
  lcd.print(line);
  for (int i = strlen(line); i < LCD_COLS; i++) {
    lcd.print(' ');
  }
}

void pushLCDLog(const char* msg) {
  char text[LCD_COLS + 1];
  snprintf(text, sizeof(text), "%s", msg);

  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);

  int lastIndex = (lcdLogStart + lcdLogCount - 1 + LCD_LOG_BUFFER_SIZE) % LCD_LOG_BUFFER_SIZE;
  if (lcdLogCount > 0 && strcmp(text, lcdLogBuffer[lastIndex]) == 0) {
    xSemaphoreGive(lcdLogMutex);
    return;
  }

  if (lcdLogCount < LCD_LOG_BUFFER_SIZE) {
    int idx = (lcdLogStart + lcdLogCount) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
    lcdLogCount++;
  } else {
    lcdLogStart = (lcdLogStart + 1) % LCD_LOG_BUFFER_SIZE;
    int idx = (lcdLogStart + lcdLogCount - 1) % LCD_LOG_BUFFER_SIZE;
    strcpy(lcdLogBuffer[idx], text);
  }

  xSemaphoreGive(lcdLogMutex);
}

void getCurrentLCDLog(char* out, size_t outSize) {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount == 0) {
    out[0] = '\0';
  } else {
    if (lcdLogIndex >= lcdLogCount) {
      lcdLogIndex = 0;
    }
    int idx = (lcdLogStart + lcdLogIndex) % LCD_LOG_BUFFER_SIZE;
    snprintf(out, outSize, "%s", lcdLogBuffer[idx]);
  }
  xSemaphoreGive(lcdLogMutex);
}

void advanceLCDLog() {
  xSemaphoreTake(lcdLogMutex, portMAX_DELAY);
  if (lcdLogCount > 1) {
    lcdLogIndex = (lcdLogIndex + 1) % lcdLogCount;
  }
  xSemaphoreGive(lcdLogMutex);
}

void updateLCDScroll(unsigned long now) {
  if (now - lastLogScroll >= LCD_SCROLL_INTERVAL) {
    lastLogScroll = now;
    advanceLCDLog();
  }
}

void displayStatusOnLCD(float avgTemp, float avgHumid) {
  char line0[LCD_COLS + 1];
  bool stepperMoving = stepper.distanceToGo() != 0;
  const char* wifiState = wifiConnected ? "OK" : "--";

  if (autonomousMode) {
    snprintf(line0, sizeof(line0), "AUTO W:%s S:%s", wifiState, stepperMoving ? "ON" : "OFF");
  } else {
    snprintf(line0, sizeof(line0), "T:%.0f H:%d W:%s", avgTemp, (int)avgHumid, wifiState);
  }
  printLCDLine(0, line0);

  char line1[LCD_COLS + 1];
  getCurrentLCDLog(line1, sizeof(line1));
  printLCDLine(1, line1);
}

// ============================================================
//  WIFI & SERVEUR (Core 0 - NetworkTask)
// ============================================================

void buildServerUrl(const char* endpoint, char* output, size_t size) {
  snprintf(output, size, "http://%s:%d%s", serverIP, serverPort, endpoint);
}

void connectWiFi() {
  if (WiFi.status() == WL_CONNECTED) {
    return;
  }

  WiFi.mode(WIFI_STA);
  WiFi.setHostname(HOSTNAME);
  Serial.println(F("Connexion WiFi..."));
  WiFi.begin(ssid, password);

  unsigned long start = millis();
  while (WiFi.status() != WL_CONNECTED && millis() - start < WIFI_TIMEOUT) {
    vTaskDelay(pdMS_TO_TICKS(500)); 
    // FIX 2 : Feed du WDT dans la boucle d'attente WiFi pour éviter le reset intempestif
    esp_task_wdt_reset(); 
    Serial.print(".");
  }

  bool isConnected = (WiFi.status() == WL_CONNECTED);
  xSemaphoreTake(stateMutex, portMAX_DELAY);
  shared.wifiConnected = isConnected;
  xSemaphoreGive(stateMutex);

  if (isConnected) {
    Serial.println("\nConnecte — IP: " + WiFi.localIP().toString());
    pushLCDLog("WiFi connecte");
  } else {
    Serial.printf("\nEchec WiFi (statut=%d)\n", WiFi.status());
    pushLCDLog("WiFi echec");
  }
}

void checkAutonomousMode_locked() {
  if (!shared.autonomousMode && shared.serverFailCount >= MAX_SERVER_RETRIES) {
    shared.autonomousMode = true;
    Serial.println(F("\n*** MODE AUTONOME ACTIVE ***"));
    Serial.printf("  %d echecs consecutifs\n", MAX_SERVER_RETRIES);
    pushLCDLog("Mode autonome");
  }
}

bool sendDataToServer(const String& jsonPayload) {
  if (WiFi.status() != WL_CONNECTED) {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.wifiConnected = false;
    shared.serverFailCount++;
    checkAutonomousMode_locked();
    xSemaphoreGive(stateMutex);
    return false;
  }

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/values", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("Content-Type", "application/json");
  http.addHeader("x-api-key", apiKey);

  int code = http.POST(jsonPayload);

  xSemaphoreTake(stateMutex, portMAX_DELAY);
  bool success = false;
  if (code > 0) {
    Serial.printf("POST /sensor/values -> %d\n", code);
    if (code == HTTP_CODE_OK || code == HTTP_CODE_CREATED) {
      pushLCDLog("Serveur OK");
      shared.serverFailCount = 0;
      shared.serverConnected = true;
      success = true;
    } else {
      char msg[LCD_COLS + 1];
      snprintf(msg, sizeof(msg), "Serveur err %d", code);
      pushLCDLog(msg);
      shared.serverFailCount++;
      shared.serverConnected = false;
      checkAutonomousMode_locked();
    }
  } else {
    Serial.printf("POST echec: %s\n", http.errorToString(code).c_str());
    pushLCDLog("POST echec");
    shared.serverFailCount++;
    shared.serverConnected = false;
    checkAutonomousMode_locked();
  }
  xSemaphoreGive(stateMutex);

  http.end();
  return success;
}

