Herin-iaina/esp32-fastapi/routers/main.cpp
void tryReconnectToServer() {
  if (WiFi.status() != WL_CONNECTED) {
    connectWiFi();
    return;
  }

  Serial.println(F("Tentative de reconnexion au serveur..."));
  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/status", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();
  http.end();

  if (code == HTTP_CODE_OK) {
    Serial.println(F("Serveur accessible — sortie du mode autonome"));
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.autonomousMode  = false;
    shared.serverFailCount = 0;
    shared.serverConnected = true;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Serveur retrouve");
    pushLCDLog("Mode normal");
  } else {
    Serial.printf("Reconnect serveur echec -> %d\n", code);
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.serverConnected = false;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Server NOK");
  }
}

bool getAutomationStatus() {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/status", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();

  if (code == HTTP_CODE_OK) {
    String response = http.getString();
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, response);
    if (!error) {
      bool fanCmd   = doc["fan"]        | false;
      bool humidCmd = doc["humidifier"] | false;

      xSemaphoreTake(stateMutex, portMAX_DELAY);
      shared.fanCmdFromServer     = fanCmd;
      shared.humidCmdFromServer   = humidCmd;
      shared.automationCmdPending = true;
      shared.serverConnected      = true;
      xSemaphoreGive(stateMutex);

      pushLCDLog("Server OK");
      pushLCDLog("Cmd automation");
      http.end();
      return true;
    }
    pushLCDLog("JSON statut err");
  } else {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.serverConnected = false;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Server NOK");
  }

  http.end();
  return false;
}

bool getStepperCommand() {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiClient wifiClient;
  HTTPClient http;
  char url[128];
  buildServerUrl("/sensor/automation/stepper", url, sizeof(url));
  http.setTimeout(HTTP_TIMEOUT);
  http.begin(wifiClient, url);
  http.addHeader("x-api-key", apiKey);
  int code = http.GET();

  if (code == HTTP_CODE_OK) {
    String response = http.getString();
    JsonDocument doc;
    DeserializationError error = deserializeJson(doc, response);
    if (!error) {
      if (doc["stepper"] | false) {
        xSemaphoreTake(stateMutex, portMAX_DELAY);
        shared.stepperRequestPending = true;
        xSemaphoreGive(stateMutex);
        pushLCDLog("Stepper ON (srv)");
      }
      http.end();
      return true;
    }
    pushLCDLog("JSON stepper err");
  } else {
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.serverConnected = false;
    xSemaphoreGive(stateMutex);
    pushLCDLog("Server NOK");
  }

  http.end();
  return false;
}

// ============================================================
//  TÂCHE RÉSEAU (Core 0)
// ============================================================
void networkTaskFunction(void* pvParameters) {
  esp_task_wdt_add(NULL);

  unsigned long lastAutomationPoll   = 0;
  unsigned long lastReconnectAttempt = 0;

  connectWiFi();

  for (;;) {
    esp_task_wdt_reset();
    unsigned long now = millis();

    bool isConnected = (WiFi.status() == WL_CONNECTED);
    xSemaphoreTake(stateMutex, portMAX_DELAY);
    shared.wifiConnected = isConnected;
    bool localAutonomous = shared.autonomousMode;
    xSemaphoreGive(stateMutex);

    if (!isConnected) {
      connectWiFi();
    }

    if (localAutonomous) {
      if (now - lastReconnectAttempt >= RECONNECT_INTERVAL) {
        lastReconnectAttempt = now;
        tryReconnectToServer();
      }
    } else {
      bool   hasData = false;
      String payloadCopy;

      xSemaphoreTake(stateMutex, portMAX_DELAY);
      if (shared.sensorDataReady) {
        payloadCopy = shared.pendingPayload;
        shared.sensorDataReady = false;
        hasData = true;
      }
      xSemaphoreGive(stateMutex);

      if (hasData) {
        sendDataToServer(payloadCopy);
      }

      if (now - lastAutomationPoll >= AUTOMATION_POLL_INTERVAL) {
        lastAutomationPoll = now;
        getAutomationStatus();
        getStepperCommand();
      }
    }

    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

// ============================================================
//  LOGIQUE DE SECOURS AVEC HYSTÉRÉSIS (Core 1)
// ============================================================

void applyBackupLogic(float avgTemp, float avgHumid) {
  if (avgTemp > 0.0f) {
    if (avgTemp < (TEMP_MIN - TEMP_HYSTERESIS)) {
      fanOn = true;
    } else if (avgTemp > TEMP_TARGET) {
      fanOn = false;
    }
    digitalWrite(FAN_PIN, fanOn ? HIGH : LOW);
  }

  if (avgHumid > 0.0f) {
    if (avgHumid < (HUMIDITY_MIN - HUMIDITY_HYSTERESIS)) {
      humidifierOn = true;
    } else if (avgHumid > HUMIDITY_TARGET) {
      humidifierOn = false;
    }
    digitalWrite(HUMIDIFIER_PIN, humidifierOn ? HIGH : LOW);
  }
}

SensorData readSensor(DHT& dht, int num) {
  SensorData data;
  data.humidity    = dht.readHumidity();
  data.temperature = dht.readTemperature();
  data.valid       = !isnan(data.humidity) && !isnan(data.temperature);
  if (!data.valid) {
    Serial.printf("Capteur %d: ERREUR\n", num);
    data.temperature = 0.0f;
    data.humidity    = 0.0f;
  }
  return data;
}

void calculateAverages(SensorData sensors[], int count, float& avgTemp, float& avgHumid, int& failedCount) {
  float tTotal = 0.0f, hTotal = 0.0f;
  int valid = 0;
  failedCount = 0;

  for (int i = 0; i < count; i++) {
    if (sensors[i].valid) {
      tTotal += sensors[i].temperature;
      hTotal += sensors[i].humidity;
      valid++;
    } else {
      failedCount++;
    }
  }

  avgTemp  = valid > 0 ? tTotal / valid : 0.0f;
  avgHumid = valid > 0 ? hTotal / valid : 0.0f;
}

void initLEDs() {
  const int pins[] = { LED_GREEN_PIN, LED_ORANGE_PIN, LED_RED_PIN, LED_BLUE_PIN };
  for (int p : pins) {
    pinMode(p, OUTPUT);
    digitalWrite(p, LOW);
  }
}

void setAllLEDsOff() {
  digitalWrite(LED_GREEN_PIN,  LOW);
  digitalWrite(LED_ORANGE_PIN, LOW);
  digitalWrite(LED_RED_PIN,    LOW);
  digitalWrite(LED_BLUE_PIN,   LOW);
}

void updateStatusLEDs(float avgTemp, float avgHumid, bool serverOk) {
  setAllLEDsOff();

